In [1]:
import pandas as pd

### 1. Reading the dataset

In [2]:
df = pd.read_csv("madrid_airbnb_data_2023.csv")

### 2. Show the dataset

In [3]:
df

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,number_of_reviews_ltm,license
0,6369,Rental unit in Madrid · ★4.87 · 1 bedroom · 1 ...,13660,Simon,Chamartín,Hispanoamérica,40.457240,-3.676880,Private room,90,4,104,2023-05-31,0.65,1,98,9,NaN
1,21853,Rental unit in Madrid · ★4.58 · 1 bedroom · 1 ...,83531,Abdel,Latina,Cármenes,40.403810,-3.741300,Private room,31,4,33,2018-07-15,0.31,2,313,0,NaN
2,451174,casa particular in Madrid · ★4.71 · 1 bedroom ...,2240898,Alejandro,Chamberí,Almagro,40.434551,-3.698387,Private room,47,3,33,2023-06-05,0.53,1,72,21,NaN
3,24805,Rental unit in Madrid · ★4.90 · 6 bedrooms · 1...,346366726,Alvaro,Centro,Universidad,40.421830,-3.705290,Entire home/apt,92,5,29,2023-05-23,0.28,1,161,11,NaN
4,456165,Guest suite in Madrid · ★5.0 · 1 bedroom · 1 b...,617086,Agata,Carabanchel,Comillas,40.390320,-3.713820,Private room,30,2,10,2023-05-21,0.14,1,4,3,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
23519,908757271360095110,Rental unit in Madrid · ★New · 2 bedrooms · 2 ...,518713670,Bemadrid,Centro,Embajadores,40.409300,-3.695370,Entire home/apt,128,30,0,NaN,NaN,30,364,0,NaN
23520,908768034188159973,Rental unit in Madrid · ★New · 3 bedrooms · 3 ...,518713670,Bemadrid,Moncloa - Aravaca,Argüelles,40.430675,-3.720135,Entire home/apt,129,30,0,NaN,NaN,30,365,0,NaN
23521,908772325334371147,Rental unit in Madrid · ★New · 1 bedroom · 1 b...,460488106,Alexander,Barajas,Timón,40.471325,-3.584069,Private room,33,1,0,NaN,NaN,2,352,0,NaN
23522,908774672501330570,Rental unit in Madrid · ★New · 1 bedroom · 1 b...,518713670,Bemadrid,Chamartín,Castilla,40.470550,-3.673990,Entire home/apt,100,30,0,NaN,NaN,30,365,0,NaN
23523,908784742161639676,Rental unit in Madrid · ★New · 2 bedrooms · 2 ...,518713670,Bemadrid,Salamanca,Lista,40.431580,-3.674990,Entire home/apt,92,30,0,NaN,NaN,30,365,0,NaN

### 3. Show the first dataset rows --> `.head()`

In [4]:
df.head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,number_of_reviews_ltm,license
0,6369,Rental unit in Madrid · ★4.87 · 1 bedroom · 1 ...,13660,Simon,Chamartín,Hispanoamérica,40.457240,-3.676880,Private room,90,4,104,2023-05-31,0.65,1,98,9,NaN
1,21853,Rental unit in Madrid · ★4.58 · 1 bedroom · 1 ...,83531,Abdel,Latina,Cármenes,40.403810,-3.741300,Private room,31,4,33,2018-07-15,0.31,2,313,0,NaN
2,451174,casa particular in Madrid · ★4.71 · 1 bedroom ...,2240898,Alejandro,Chamberí,Almagro,40.434551,-3.698387,Private room,47,3,33,2023-06-05,0.53,1,72,21,NaN
3,24805,Rental unit in Madrid · ★4.90 · 6 bedrooms · 1...,346366726,Alvaro,Centro,Universidad,40.421830,-3.705290,Entire home/apt,92,5,29,2023-05-23,0.28,1,161,11,NaN
4,456165,Guest suite in Madrid · ★5.0 · 1 bedroom · 1 b...,617086,Agata,Carabanchel,Comillas,40.390320,-3.713820,Private room,30,2,10,2023-05-21,0.14,1,4,3,NaN

### 4. Show the last dataset rows --> `.tail()`

In [5]:
df.tail()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,number_of_reviews_ltm,license
23519,908757271360095110,Rental unit in Madrid · ★New · 2 bedrooms · 2 ...,518713670,Bemadrid,Centro,Embajadores,40.409300,-3.695370,Entire home/apt,128,30,0,NaN,NaN,30,364,0,NaN
23520,908768034188159973,Rental unit in Madrid · ★New · 3 bedrooms · 3 ...,518713670,Bemadrid,Moncloa - Aravaca,Argüelles,40.430675,-3.720135,Entire home/apt,129,30,0,NaN,NaN,30,365,0,NaN
23521,908772325334371147,Rental unit in Madrid · ★New · 1 bedroom · 1 b...,460488106,Alexander,Barajas,Timón,40.471325,-3.584069,Private room,33,1,0,NaN,NaN,2,352,0,NaN
23522,908774672501330570,Rental unit in Madrid · ★New · 1 bedroom · 1 b...,518713670,Bemadrid,Chamartín,Castilla,40.470550,-3.673990,Entire home/apt,100,30,0,NaN,NaN,30,365,0,NaN
23523,908784742161639676,Rental unit in Madrid · ★New · 2 bedrooms · 2 ...,518713670,Bemadrid,Salamanca,Lista,40.431580,-3.674990,Entire home/apt,92,30,0,NaN,NaN,30,365,0,NaN

### Create a new dataframe with Pandas


#### What's a DataFrame?

A DataFrame is a two-dimensional tabular data structure (columns and rows) with an index in each row.

In [7]:
kids_born = pd.DataFrame({'year_born':[2013,2014,2012,2011,2021],
                          'name':["Mila","Sara", "Mathias","Juan Vicente", "Mario" ],
                          'mom_name':["Mona", "Mona", "Steph", "Lina", "Maria Angelica"],
                          'country':["Finland", "Finland", "Spain", "Colombia", "Colombia"]
                          })

In [8]:
kids_born

   year_born          name        mom_name   country
0       2013          Mila            Mona   Finland
1       2014          Sara            Mona   Finland
2       2012       Mathias           Steph     Spain
3       2011  Juan Vicente            Lina  Colombia
4       2021         Mario  Maria Angelica  Colombia

### Rename columns in a dataframe

#### Rename one column

In [9]:
kids_born.rename(columns={'name':'new_name'})

   year_born      new_name        mom_name   country
0       2013          Mila            Mona   Finland
1       2014          Sara            Mona   Finland
2       2012       Mathias           Steph     Spain
3       2011  Juan Vicente            Lina  Colombia
4       2021         Mario  Maria Angelica  Colombia

#### Rename two or more columns

In [13]:
kids_born.rename(columns={'name':'kid_name', 'year_born':'birth_year'})

   birth_year      kid_name        mom_name   country
0        2013          Mila            Mona   Finland
1        2014          Sara            Mona   Finland
2        2012       Mathias           Steph     Spain
3        2011  Juan Vicente            Lina  Colombia
4        2021         Mario  Maria Angelica  Colombia

#### Save the new names into dataframe

Para guardar todos los cambios que se realicen al DataFrame debemos utilizar el operdaor de asignación **=**

Example:

`name_of_dataframe = the_action( for example rename.columns)`

In [12]:
kids_born = kids_born.rename(columns={'name':'kid_name'})

### Exercise: Rename columns of AirBnB Dataframe

### Explore the basic information of the dataframe

`ìnfo()` --> give us:
1. Number of columns
2. Number of rows
3. and data types

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23524 entries, 0 to 23523
Data columns (total 18 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   id                              23524 non-null  int64
 1   name                            23524 non-null  object
 2   host_id                         23524 non-null  int64
 3   host_name                       23521 non-null  object
 4   neighbourhood_group             23524 non-null  object
 5   neighbourhood                   23524 non-null  object
 6   latitude                        23524 non-null  float64
 7   longitude                       23524 non-null  float64
 8   room_type                       23524 non-null  object
 9   price                           23524 non-null  int64
 10  minimum_nights                  23524 non-null  int64
 11  number_of_reviews               23524 non-null  int64
 12  last_review                     18505 non-null  object
 13  reviews_per_month               18505 non-null  float64
 14  calculated_host_listings_count  23524 non-null  int64
 15  availability_365                23524 non-null  int64
 16  number_of_reviews_ltm           23524 non-null  int64
 17  license                         2652 non-null   object
dtypes: float64(3), int64(8), object(7)
memory usage: 3.2+ MB

### If I just want the columns names I can use `.columns`

In [15]:
df.columns

Index(['id', 'name', 'host_id', 'host_name', 'neighbourhood_group',
       'neighbourhood', 'latitude', 'longitude', 'room_type', 'price',
       'minimum_nights', 'number_of_reviews', 'last_review',
       'reviews_per_month', 'calculated_host_listings_count',
       'availability_365', 'number_of_reviews_ltm', 'license'],
      dtype='object')

In [16]:
df = df.rename(columns={'host_name':'owner_name'})
df.columns

Index(['id', 'name', 'host_id', 'owner_name', 'neighbourhood_group',
       'neighbourhood', 'latitude', 'longitude', 'room_type', 'price',
       'minimum_nights', 'number_of_reviews', 'last_review',
       'reviews_per_month', 'calculated_host_listings_count',
       'availability_365', 'number_of_reviews_ltm', 'license'],
      dtype='object')